# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import pandas as pd

# Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
# your code here
temp=pd.read_csv("Temp_States.csv")
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Print `temp`.

In [3]:
# your code here
print(temp)

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [7]:
# your code here
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   City         7 non-null      object
 1   State        7 non-null      object
 2   Temperature  7 non-null      float64
dtypes: float64(1), object(2)
memory usage: 296.0+ bytes

In [ ]:
"""
City and State are string
Temperature is a float
"""

#### Select the rows where state is New York.

In [8]:
# your code here
temp[temp["State"] == "New York"]

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [9]:
# your code here
temp[temp["State"] == "New York"].mean()

C:\Users\buldu\AppData\Local\Temp\ipykernel_17004\177408356.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  temp[temp["State"] == "New York"].mean()

Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [10]:
# your code here
temp[temp["Temperature"] > 15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [11]:
# your code here
temp[temp["Temperature"] > 15]["City"]

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [16]:
# your code here
temp[temp["Temperature"].between(15,20)]["City"]

0         NYC
3    Hartford
6      Newark
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [22]:
# your code here
temp.groupby("State").mean()

             Temperature
State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741

#  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [23]:
# your code here
employees = pd.read_csv("Employees.csv")
employees

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
3        Admin    Master         VP  Manuella     15      33
4        Sales    Master    Analyst     Carla      6      38
..         ...       ...        ...       ...    ...     ...
495      Sales       PhD         VP    Calvin      2     119
496         HR    Master    Analyst    Dustin      6      67
497      Sales       PhD         VP   Winston     13      93
498         IT       PhD    Analyst      Earl     12     108
499      Sales    Master    Analyst     Alvin     13      48

[500 rows x 6 columns]

#### Explore the data types of the `employees` dataframe. Comment your results.

In [33]:
# your code here
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Department  500 non-null    object
 1   Education   500 non-null    object
 2   Title       500 non-null    object
 3   Name        500 non-null    object
 4   Years       500 non-null    int64
 5   Salary      500 non-null    int64
dtypes: int64(2), object(4)
memory usage: 23.6+ KB

In [ ]:
"""
Years and salary are in integers, so that's good for analysis
"""

#### What's the average salary in this company?

In [28]:
# your code here
employees.Salary.mean()

73.528

#### What's the highest salary?

In [31]:
# your code here
employees.Salary.max()

120

#### What's the lowest salary?

In [34]:
# your code here
employees.Salary.min()

30

#### Who are the employees with the lowest salary?

In [37]:
# your code here
employees.groupby("Education").mean()["Salary"]

Education
Bachelor    76.116564
Master      71.287356
PhD         73.331288
Name: Salary, dtype: float64

In [38]:
employees.groupby("Department").mean()["Salary"]

# IT persons are the ones with lowest salary

Department
Admin    76.325203
HR       74.237705
IT       70.671642
Sales    73.132231
Name: Salary, dtype: float64

In [39]:
employees.groupby("Title").mean()["Salary"]

Title
Analyst      73.703911
VP           72.907975
associate    73.968354
Name: Salary, dtype: float64

#### Find all the information about an employee called David.

In [40]:
# your code here
employees[employees["Name"].str.contains("David")]

    Department Education      Title   Name  Years  Salary
0        Admin    Master  associate  David      4      58
124         IT  Bachelor         VP  David      3      31

#### Could you return only David's salary?

In [41]:
# your code here
employees[employees["Name"].str.contains("David")]["Salary"]

0      58
124    31
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [42]:
# your code here
employees[employees["Title"].str.contains("associate")]

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
7           HR    Master  associate     Carol     14      53
8        Admin       PhD  associate      Jean      8      50
..         ...       ...        ...       ...    ...     ...
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
491      Admin       PhD  associate     Alice      8      37
494      Sales  Bachelor  associate   Vanessa     11     118

[158 rows x 6 columns]

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [43]:
# Method 1
# your code here
employees.head(3)

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

In [45]:
# Method 2
# your code here
employees.iloc[[0,1,2]]

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

#### Find the employees whose title is associate and whose salary is above 55.

In [49]:
# your code here
employees[(employees["Title"].str.contains("associate")) & (employees["Salary"] >= 55)]

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
9        Admin    Master  associate    Kareem      3     104
10       Admin    Master  associate   Cynthia      1     114
16       Admin  Bachelor  associate    Shanon      1      99
18       Admin  Bachelor  associate     Megan      9      79
..         ...       ...        ...       ...    ...     ...
476      Admin       PhD  associate      Greg      8      93
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
494      Sales  Bachelor  associate   Vanessa     11     118

[104 rows x 6 columns]

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [50]:
# your code here
employees.groupby("Years").mean()

          Salary
Years
1      75.863636
2      75.857143
3      74.571429
4      77.129032
5      73.857143
6      72.382353
7      73.840000
8      64.250000
9      76.741935
10     73.351351
11     74.866667
12     73.454545
13     71.935484
14     70.968750
15     69.758621

####  What is the average salary per title?

In [51]:
# your code here
employees.groupby("Title").mean()

              Years     Salary
Title
Analyst    7.849162  73.703911
VP         7.619632  72.907975
associate  7.158228  73.968354

####  Find the salary quartiles.

In [54]:
# your code here
employees.Salary.describe()

count    500.000000
mean      73.528000
std       26.890061
min       30.000000
25%       50.000000
50%       72.000000
75%       97.000000
max      120.000000
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [ ]:
# your code here
# There is no information regarding gender in dataset

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [58]:
# your code here
employees.groupby("Department").describe()

            Years                                                 Salary  \
            count      mean       std  min   25%  50%   75%   max  count
Department
Admin       123.0  7.642276  4.706344  1.0  3.00  8.0  12.0  15.0  123.0
HR          122.0  7.172131  4.292397  1.0  3.25  6.0  11.0  15.0  122.0
IT          134.0  8.141791  4.472393  1.0  4.00  8.5  12.0  15.0  134.0
Sales       121.0  7.206612  4.358741  1.0  3.00  7.0  11.0  15.0  121.0


                 mean        std   min    25%   50%    75%    max
Department
Admin       76.325203  25.734615  30.0  53.50  78.0  98.00  120.0
HR          74.237705  26.522423  30.0  50.25  74.5  96.00  119.0
IT          70.671642  27.406101  30.0  46.25  69.0  97.75  120.0
Sales       73.132231  27.819340  30.0  49.00  69.0  95.00  120.0

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [ ]:
# your code here

# Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here
# there is no Orders Dataset

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here